# Taps (repositories) 
tap "homebrew/autoupdate"
tap "mongodb/brew"

# Brews (packages)
brew "bat"
brew "eza"
brew "git" # is this not already installed by default?
brew "httpie"
brew "mongodb/brew/mongodb-community"

# Casks (macOS applications)
cask "insomnia"
cask "mongodb-compass"
cask "rider"

# VSCode Extensions?
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mongodb.mongodb-vscode"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "ritwickdey.liveserver"
